#ifndef ERRLIB_H
#define ERRLIB_H

////////// errlib ////////////////////////////////////////////////////////////
// Автор    : Баталов Семен, Зарина Максудова, Дарья Белоусова              //
// Дата     : ??.??.2020                                                    //
// Описание : Здесь представлены инструменты для обработки исключительных   //
//            ситуаций в модулях моделирования течения жидкости.            //
//////////////////////////////////////////////////////////////////////////////

#include <exception>

namespace err
{
    ////////// class FluidException //////////////////////////////////////////
    // Дочерний класс, унаследованный от "std::exception". Содежит в себе   //
    // код ошибки "errCode_" >= 0 (0 - отсутствие ошибок).                  //
    // Описание ошибок см. файл....                                         //
    //////////////////////////////////////////////////////////////////////////
    
    class FluidException : public std::exception
    {
        private :
            
            int errCode_;   // Код ошибки
            
        public :
            
            // (1) Конструктор (обнуляет поле)
            FluidException();
            
            // (2) Конструктор (инициализирует поле)
            FluidException(const int& code);
            
            // (3) Конструктор копирования
            FluidException(const FluidException& exeption);
            
            // (4) Перегрузка оператора присваивания
            FluidException& operator=(const FluidException& exeption);
            
            // (5) Возвращает код ошибки
            int error() const;
            
            // (6) Установить значение ошибки
            void setErrCode(const int& code);
    };
}

#endif