#ifndef FLUIDLIB2D_H
#define FLUIDLIB2D_H

////////// fluidlib //////////////////////////////////////////////////////////
// Авторы   : Баталов Семен, Зарина Максудова, Дарья Белоусова              //
// Дата     : ??.??.2020                                                    //
//////////////////////////////////////////////////////////////////////////////

#include "basic.h"
#include "exception.h"
#include "components2d.h"
#include "tools2d.h"
#include "fluids2d.h"
#include "borders2d.h"

namespace fluid
{
    ////////// struct Model2D ////////////////////////////////////////////////
    // Хранит всю информацию для моделирования течения жидкости или газа в  //
    // определенной системе с граничными условиями. Включает:               //
    //                                                                      //
    // 1) Fluid2D  : параметры, связанные с жидкостью.                      //
    // 2) Border2D : параметры граничных условий.                           //
    //////////////////////////////////////////////////////////////////////////
    
    struct Model2D
    {
        public :
            
            // Все параметры жидкости и системы
            Fluid2D fluid2D;
            
            // Информация о всех граничных условиях
            Border2D border2D;
            
        public :
            
            // (1) Конструктор
            Model2D() = default;
            
            // (2) Конструктор копирования
            Model2D(const Model2D& model) = default;
            
            // (3) Перегрузка оператора присваивания
            Model2D& operator=(const Model2D& model) = default;
            
            // (4) Деструктор
            ~Model2D() = default;
    };
    
    ////////// class Modeler2D ///////////////////////////////////////////////
    // Моделирует течение жидкости в определенной системе, которая          //
    // описывается структурой "Model2D". Включает:                          //
    //                                                                      //
    // 1) BasicTools2D    : Базовые инструменты моделирования.              //
    // 2) FluidModeler2D  : Моделирует течение жидкости.                    //
    // 3) BorderModeler2D : Моделирует граничные условия.                   //
    //////////////////////////////////////////////////////////////////////////
    
    class Modeler2D
    {
        private :
            
            // Набор базовых инструментов
            BasicTools2D tools2D_;
            
            // Моделирует течение жидкости
            FluidModeler2D fluid2D_;
            
            // Моделирует действие граничных условий
            BorderModeler2D border2D_;
            
        public :
            
            // (1) Конструктор
            Modeler2D() = default;
            
            // (2) Конструктор копирования
            Modeler2D(const Modeler2D& modeler) = delete;
            
            // (3) Перегрузка оператора присваивания
            Modeler2D& operator=(const Modeler2D& modeler) = delete;
            
            // (4) Инициализация всех полей
            void initialize(int sizeX, int sizeY, Model2D& model2D);
            
            // (5) Производит переход в новое состояние, базируясь на текущем
            void compute();
            
            // (6) Установка значений по умолчанию
            void clear();
            
            // (7) Деструктор
            ~Modeler2D() = default;
    };
}

#endif